{"HotelName":{"0":"Adelphi Hotel","1":"Adelphi Hotel","10":"Adelphi Hotel","11":"Adelphi Hotel","12":"Adelphi Hotel","13":"Adelphi Hotel","14":"Adelphi Hotel","15":"Adelphi Hotel","16":"Adelphi Hotel","17":"Adelphi Hotel","18":"Adelphi Hotel","19":"Adelphi Hotel","2":"Adelphi Hotel","20":"Adelphi Hotel","21":"Adelphi Hotel","22":"Adelphi Hotel","23":"Adelphi Hotel","24":"Adelphi Hotel","25":"Adelphi Hotel","26":"Adelphi Hotel","27":"Adelphi Hotel","28":"Adelphi Hotel","29":"Adelphi Hotel","3":"Adelphi Hotel","30":"Adelphi Hotel","31":"Adelphi Hotel","32":"Adelphi Hotel","4":"Adelphi Hotel","5":"Adelphi Hotel","6":"Adelphi Hotel","7":"Adelphi Hotel","8":"Adelphi Hotel","9":"Adelphi Hotel"},"PositiveReview":{"0":"I really enjoyed the personal.  I live locally, and have known the Adelphi for many years.  I frequently took friends to the old Adelphi for beverages in the old back garden.  I went in Since the renovation, and enjoyed the friendliness, and beauty of the facility.  Lovely experience all around.","1":"We were married here almost 20 yrs ago and they have made a beautiful renovation. It was lovely to see it anew.","10":"The room was absolutely amazing! The room where the bed was located was a touch small but the all the amenities and the amazing bathroom completely made up for it.","11":"Beautifully renovated hotel in the center of Saratoga Springs! All the bells and whistles (including heated Toto toilet seats :-)","12":"The bathroom was very luxurious with all the fancy modern touches.","13":"I have been waiting for this hotel to open for so long. I stayed there almost 20 years ago when I was at school.  The exterior is absolutely beautiful.  The rooms are small but beautiful.  The bathrooms are almost as large as the rooms with heated floors.  I think they spent most of their money on the bathrooms.  The staff was friendly and accommodating.  \rThe one thing I was not so wowed at was all of the common spaces.  The lobby, check-in area and bar were nice but I was thinking I was going to be brought back to turn of the century wow.  Don't get me wrong, it is lovely, they just cut a lot of corners.  The lobby looks to be marble, but it is tile.  The wallpaper in the lobby is just so and the check-in area is nothing special.  They could have done so much more with these spaces.  We spoke to a bunch of people who were also staying at the hotel and they too were waiting for the wow factor.  It just wasn't there.  \rI would stay here again off season as the rates are very high in the summer.  I'm glad I stayed as the weekend was lovely and now I won't wonder what's there.  We come to Saratoga a few times a year and will look to the re-opening of the Gideon Putnam next.","14":"The renovated Adelphi is beautiful. What a great atmosphere. \rThe staff was helpful. They were very accommodating when it came to parking\/valet and anything we required. \rBoth of our breakfast meals were fantastic!","15":"Loved the place location and bathroom !!\/","16":"Loved the uber-personal service by all staff we got in contact - check-in, valet, etc...they even knew our dogs name.\rAlso Wally had  a bowl, leash, poop bags, and horse shoe toy waiting for her in the room.\rLoved the snacks and drinks in the room - complimentary.\rVery European classy hotel experience!!! We will be back.","17":"Beautifully renovated.  The decor is elegant, and the bathroom was the jewel of the room with heated floors & heated toilet seat with aerated filter for camode\/beday. It also had an enormous bathtub to fit my 6' 2\" frame! The bed was the most comfortable I have ever slept on.  The best feature was the electronic window shade & drapery enclosure.  Complete blackout for those that require pitch black to sleep. Alonso, Victoria & Sarafina were the best server team in the city of Saratoga!  Impeccable service, which  this city lacks!!","18":"The beds were so comfortable, the room was beautiful. Loved the bathroom, towel warmer and all the extras!","19":"Hospitality\/Service, Smart technology in the room,!Location, and Salt & Chart & Morrisey's restaurants.","2":"Older boutique hotel with modern amenities like heated marble floors in bathroom, motorized shades and curtains, heated toiket seat, all lighting contolled by switches next to bed. Great pub and fabulous dining. Walk out front door to all the shopping one could want. Architecture of hotel is beautiful","20":"Food and service was Excellent! Highly recommend staying here.","21":"Everything.\nBeautifully designed, wonderful staff and my favourite hotel we stayed in on our trip by far.","22":"Loved the room and hotel amenities. Very spacious room.","23":"Location, overall cleanliness, tastefully done.","24":"A beautiful and comfortable hotel with great staff ","25":"Gorgeous Hotel and the room was equally amazing, ..... very accommodating staff!","26":"gorgeous and modern room. Personalized attention (notes and snacks!)","27":"Everything but the parking arrangement.","28":"It was above and beyond everything was perfect, cozy, quiet, view, perfect location- definitely would stay again! Everything we needed!","29":"Everything in the room was beautiful, the bed was super comfortable, and the staff was attentive and friendly.","3":"Beautiful room and building - restoration well-done\rGorgeous bathroom \rFull size spa quality bath products\rDelicious snacks \rFriendly and professional staff","30":"A beautiful hotel - spectacular experience!","31":"New clean","32":"Luxurious! BEST BEDS!!!!!!!","4":"Rooms were beautifully appointed, front desk staff amazing, Bartenders were amazing.","5":"Everything! I’ve stayed in numerous top rated hotels across the States and Adelphi Hotel beats them all. Every one of your staff is very professional and friendly.  My daughter and i came to Saratoga because It was my daughters 27th birthday .  We are from Buffalo N.Y.  My daughter was on a private rowing team in buffalo and always came to Saratoga for regattas.  Unfortunately, she was  always busy at the water so she never saw much of Saratoga.  For my daughters birthday I took her on “A Mystery Birthday Ride” to Saratoga. She didn’t figure it out where she I was taking her until we turned on to Broadway.  To say she was thrilled is an understatement!  Then when we checked in at your hotel and she found a birthday cake in our room she was in shock.  Her exact words were.... I’m blown away that this by hotel and , that they gave me a birthday cake!!!  I can’t thank you enough for helping me make this weekend the BEST 27th birthday .  When we walked in and out of the quaint stores on Broadway every so often she would turn to me and say ... I’m still in shock we are here and I got a cake.  Just watching her glow with such a smile made MY time in Saratoga extra special!  Thank you from the bottom of my heart .\nSincerely, Sue & Bri Reinecke ","6":"This is one of the most enjoyable hotels ever.  Personnel knowledgeable and a modern four-poster bed right in the middle of town. Beautiful update right down to a good reading lamp and an old-fashioned bathtub.","7":"The communication before arrival was excellent, offering assistance with reservations and tickets. \rThe room was lovely with modern amenities. Huge bathroom, with extra special attention to details like a towel warmer and  toilet upgrades. Breakfast was included and it was delicious, highly recommend the eggs Benedict.\rThe valet was terrific; from helpful with my vehicle to having a wonderful disposition on a short staff.","8":"The renovation is amazing. Immaculate in every way. Staff friendly and efficient. Bar was fun and comfy with reasonably-priced drinks. My room was exquisite - black\/white classic marble bathroom - huge! plus Japanese toilet! Bed fantastic and crisp and white. VERY quiet and great location right in the center of town.\rAnd free parking about a block and a half away. A little pricey but it was racing season. At least a lovely breakfast was included. Can't wait to go back!","9":"I stayed at the Adelphi 25 years ago and loved it then. It was funky and a little run down but still had an air of granduer. They totally renovated and did a great job. I stay at a lot of up-scale hotels but I have to say this one might be the absolute nicest!"},"NegativeReview":{"0":"Not a thing.","1":"Last night we decided to stay another night as family lives close by and it was more expensive than I would have chosen.","10":"The bed could have been a touch firmer.","11":"Rooms a tad small (and a small window looking out the back) but so nicely done that you barely notice. And guest parking hard to find and a ways away, though they have valet, of course.","12":"We are young and were there to relax and one front desk check in staff member questioned our reason for being there.  It was aggravating to be judged because we were young and in t-shirts and shorts;  we can more than afford to stay there.","13":"It was  a great stay.  Still waiting for the wow factor in all of the open areas.","14":"The late-night bartender was a little snarky. in his defense, it was last-cal and he probably wanted to get home.","15":"Tv is hard to figure out  coffee pot is not close to outlet \rNeed  nightable and better light control \rNothing on in house menu that is simple well priced etc","16":"If there is one thing to call out it is that there were no baggage trolley - but I am assuming it is deliberate, as everybody in the hotel is helpful to get the luggage to the room.","17":"The front desk staff focus way too much on their laptops, and not on the guest standing in front of them.  Check-in took way too long due to lack of experience, and determinatlon to follow step-by-step protocol that was more then obviously being promted on their laptops.  The Blue Hen Chef & Sou Chef came out to greet, and pamper a table of 3, but totally ignored me!  There were only 2 tables occupied at the moment.  The key ingedient that peeked my intrest of the squash salad, smoked blue cheese was ommitted from the salad.  By the time the staff brought out a side ramekin of it, I had already finished the salad.  Room # 407 is located in the back of hotel.  It's location is near dumpsters that made it possible for me to hear the \"crash\" of glass bottles being thrown into it at 6am!  The view was of a brick wall & parking lot.  The room itself is very small.  Excellent for one person, but not 2.","18":"","19":"Housekeeping ","2":"No complaints","20":"","21":"Nothing","22":"","23":"No issues","24":"Nothing ","25":"","26":"maybe just a bit too pricey","27":"Parking arrangement.","28":"","29":"","3":"Elevator not functioning at 4:15 when I left.\rParking situation confusing (self parked but worried about signage in garage warning of closure during the evening- had to come back and use valet parking)","30":"Nothing.  It was all good!","31":"Over charged higher rate than promised by Bookings.com","32":"","4":"Service at Blue Hen for breakfast was not on par with the rest of hotel....slow service, dirty tables everywhere, that was the only flaw I found with this outstanding property","5":"","6":"We had a great day ... two would have been better.","7":"I had asked for a late checkout, when returning at 12n the key was demagnetized and the person at the front desk was quite snippy that checkout is at 11a. The room was on the fourth floor and the elevator is a tad slow, snails pace if you are going back and forth after this key interaction.","8":"A little too pricey","9":"everything was great"},"StayDate":{"0":"January 2019","1":"December 2018","10":"June 2018","11":"June 2018","12":"May 2018","13":"February 2018","14":"February 2018","15":"December 2017","16":"December 2017","17":"November 2017","18":"December 2018","19":"November 2018","2":"December 2018","20":"November 2018","21":"October 2018","22":"October 2018","23":"September 2018","24":"September 2018","25":"June 2018","26":"June 2018","27":"May 2018","28":"April 2018","29":"April 2018","3":"November 2018","30":"March 2018","31":"November 2017","32":"October 2017","4":"November 2018","5":"October 2018","6":"October 2018","7":"August 2018","8":"July 2018","9":"June 2018"}}